clear
clc
%Входные данные
dP = 16.7*10^6; %Изменение давления Pa
dT = 33; %Изменение температуры °С
ch = 8; %Количество акустических путей

x = 267; %Расстояние между датчиками по оси трубы
r1 = [183.75 183.25 183 183.5 183 183.5 183.75 183.25]; %Внутренние радиусы в посадочных местах одной стороны  
r2 = [183 183.25 183.25 183.75 183.5 183 183.5 183.25]; %Внутренние радиусы в посадочных местах второй стороны
E = 2*10^11;
Ks = 0.93; %Т.к. труба с фланцами
mu = 0.3; %Коэффициент Пуассона
delta = 47;
k = delta/r1(3); 

l_out = zeros(1, ch);
l1 = zeros(1, ch); l2 = zeros(1, ch);
d1 = zeros(1, ch); d2 = zeros(1, ch);
x_ratio1 = zeros(1, ch); x_ratio2 = zeros(1, ch);
raduis_1 = zeros(1, ch); raduis_2 = zeros(1, ch);
x_out1 = zeros(1, ch); x_out2 = zeros(1, ch);
diameter = zeros(1, ch);
angle = zeros(1, ch);
x_out = zeros(1, ch);
for i = 1:ch
    d1(i) = 1+Ks*((dP*r1(i))/(E*delta)); % (E.16), (E.22)
    d2(i) = 1+Ks*((dP*r2(i))/(E*delta)); 
    
    raduis_1(i) = r1(i)*d1(i); %Внутренние радиусы с влиянием давления
    raduis_2(i) = r2(i)*d2(i);

    x_ratio1(i) = 1-r1(i)*mu/(delta)*(dP/E); % (E.17)
    x_ratio2(i) = 1-r2(i)*mu/(delta)*(dP/E); 
    
    x_out1(i) = x*x_ratio1(i);
    x_out2(i) = x*x_ratio2(i);
    
    l1(i) = hypot(r1(i)*d1(i), x_out1(i)); % (E.23)
    l2(i) = hypot(r2(i)*d2(i), x_out2(i));
    diameter(i) = raduis_1(i)+raduis_2(i); %Внутренний диаметр акустического пути для каждого канала
end

l_out = l1+l2; %Длина акустического пути для каждого канала
x_out = x_out1+x_out2;

for i = 1:ch
   angle(i) = rad2deg(acos(x_out(i)/l_out(i)));  %Углы между осями акустического канала и трубопровода
end

%Входные данные датчиков 
N = 8; %Расчет для 4 пар 
D = [50.25 50.5 50 49 49.5 50 49.75 51]; %Внешние радиусы посадочных мест  
d = [31 32.5 32.25 32.75 32.5 32.25 32 31]; %Внутренние радиусы посадочных мест 
lt = [230 229 230 230.25 231 230.75 229.5 230];
lp = [220 221 220.5 220.25 221 220.75 219.5 220];
deltaLp = zeros(1, N);
deltaLt = zeros(1, N);
Et = 1.9*10^11;
Ep = 2*10^11;
alpha = 1.25*10^-5;
alpha_t = 1.5*10^-5;
for i = 1:N
    %Линейное изменеие размера посадочного места вдоль акустического пути
    %(Изменение давления)
   deltaLp(i) = dP*((lt(i)/Et)+(lp(i)/Ep)*((d(i)^2)/((D(i)^2)-(d(i)^2))));
   %(Изменение температуры)
   deltaLt(i) = lt(i)*dT*(alpha-alpha_t);
end

