%Входные данные
dP = 16.7*10^6; %Изменение давления Pa
dT = 33; %Изменение температуры °С
ch = 8; %Количество акустических путей

l = 780.117; %Длина акустического пути
x = 267.007; %Расстояние между датчиками по оси трубы
r1 = [183.75 183.25 183 183.5 183 183.5 183.75 183.25]; %Внутренние радиусы в посадочных местах одной стороны  
r2 = [183 183.25 183.25 183.75 183.5 183 183.5 183.25]; %Внутренние радиусы в посадочных местах второй стороны
E = 2*10^11;
Ks = 0.93; %Т.к. труба с фланцами
mu = 0.3; %Коэффициент Пуассона
delta = 30;

l = zeros(1, ch);
l1 = zeros(1, ch); l2 = zeros(1, ch);
d1 = zeros(1, ch); d2 = zeros(1, ch);
x_ratio1 = zeros(1, ch); x_ratio2 = zeros(1, ch);
raduis_1 = zeros(1, ch); raduis_2 = zeros(1, ch);

for i = 1:ch
    d1(i) = 1+Ks*(dP*r1(i))/(E*delta); % (E.16), (E.22)
    d2(i) = 1+Ks*(dP*r2(i))/(E*delta); 
    
    raduis_1(i) = r1(i)*d1(i); %Внутренние радиусы с влиянием давления
    raduis_2(i) = r2(i)*d2(i);

    x_ratio1(i) = (-dP*r1(i)*mu)/(E*delta); % (E.17)
    x_ratio2(i) = (-dP*r2(i)*mu)/(E*delta); 

    l1(i) = hypot(r1(i)*d1(i), x_ratio1(i)*x); % (E.23)
    l2(i) = hypot(r2(i)*d2(i), x_ratio2(i)*x);
end

l = l1++l2;